Revit 2026 API

# GenericGenericCutoutOpacity Property

---

The property labeled "Cutouts" from the "Generic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GenericCutoutOpacity { get; }
```
```vb
Public Shared ReadOnly Property GenericCutoutOpacity As String
	Get
```
```cpp
public:
static property String^ GenericCutoutOpacity {
	String^ get ();
}
```
```fsharp
static member GenericCutoutOpacity : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble". This property allows a connected asset.

#### Reference

Generic Class

Autodesk.Revit.DB.Visual Namespace